ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/DMASS0_BCDMA_0_BCDMA_GCFG.xml
<module name="DMASS0_BCDMA_0_BCDMA_GCFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="BCDMA_GCFG_REVISION" acronym="BCDMA_GCFG_REVISION" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="MODID" width="16" begin="31" end="16" resetval="0x26158" description="Module ID field" range="31 - 16" rwaccess="R"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x9" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="BCDMA_GCFG_PERF_CTRL" acronym="BCDMA_GCFG_PERF_CTRL" offset="0x4" width="32" description="The performance control register contains fields which can be used to adjust the performance of the BCDMA in the system.">
		<bitfield id="TIMEOUT_CNT" width="16" begin="15" end="0" resetval="0x64" description="This feature is not currently supported." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_GCFG_EMU_CTRL" acronym="BCDMA_GCFG_EMU_CTRL" offset="0x8" width="32" description="The emulation control register is used to control the behavior of the DMA when the emususp input is asserted.">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Soft" range="1" rwaccess="R/W"/> 
		<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x0" description="Free" range="0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_GCFG_PSIL_TO" acronym="BCDMA_GCFG_PSIL_TO" offset="0x10" width="32" description="The PSI-L proxy timeout register controls the timeout watchdog and reports timeout occurrances on PSI-L configuration transactions issued by the built in PSI-L proxy.">
		<bitfield id="TOUT" width="1" begin="31" end="31" resetval="0x0" description="Timeout occurred.  When set indicates that a timeout has occurred on a config access" range="31" rwaccess="R/W"/> 
		<bitfield id="TOUT_CNT" width="16" begin="15" end="0" resetval="0x1024" description="Timeout period.  Specifies how many cycles to wait before closing up a conifiguration read or write transaction and asserting the tout bit" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_GCFG_CAP0" acronym="BCDMA_GCFG_CAP0" offset="0x20" width="32" description="The Capabilities Register 0 specifies which standard features this BCDMA instance supports.">
		<bitfield id="GLOBAL_TRIG" width="1" begin="19" end="19" resetval="0x1" description="Global triggers 0 and 1 are supported" range="19" rwaccess="R"/> 
		<bitfield id="LOCAL_TRIG" width="1" begin="18" end="18" resetval="0x0" description="Dedicated local trigger is supported" range="18" rwaccess="R"/> 
		<bitfield id="EOL" width="1" begin="17" end="17" resetval="0x1" description="EOL field is supported" range="17" rwaccess="R"/> 
		<bitfield id="STATIC" width="1" begin="16" end="16" resetval="0x0" description="STATIC field is supported" range="16" rwaccess="R"/> 
		<bitfield id="TYPE15" width="1" begin="15" end="15" resetval="0x1" description="Type 15 TR is supported" range="15" rwaccess="R"/> 
		<bitfield id="TYPE14" width="1" begin="14" end="14" resetval="0x0" description="Type 14 TR is supported" range="14" rwaccess="R"/> 
		<bitfield id="TYPE13" width="1" begin="13" end="13" resetval="0x0" description="Type 13 TR is supported" range="13" rwaccess="R"/> 
		<bitfield id="TYPE12" width="1" begin="12" end="12" resetval="0x0" description="Type 12 TR is supported" range="12" rwaccess="R"/> 
		<bitfield id="TYPE11" width="1" begin="11" end="11" resetval="0x0" description="Type 11 TR is supported" range="11" rwaccess="R"/> 
		<bitfield id="TYPE10" width="1" begin="10" end="10" resetval="0x0" description="Type 10 TR is supported" range="10" rwaccess="R"/> 
		<bitfield id="TYPE9" width="1" begin="9" end="9" resetval="0x0" description="Type 9 TR is supported" range="9" rwaccess="R"/> 
		<bitfield id="TYPE8" width="1" begin="8" end="8" resetval="0x0" description="Type 8 TR is supported" range="8" rwaccess="R"/> 
		<bitfield id="TYPE7" width="1" begin="7" end="7" resetval="0x0" description="Type 7 TR is supported" range="7" rwaccess="R"/> 
		<bitfield id="TYPE6" width="1" begin="6" end="6" resetval="0x0" description="Type 6 TR is supported" range="6" rwaccess="R"/> 
		<bitfield id="TYPE5" width="1" begin="5" end="5" resetval="0x0" description="Type 5 TR is supported" range="5" rwaccess="R"/> 
		<bitfield id="TYPE4" width="1" begin="4" end="4" resetval="0x0" description="Type 4 TR is supported" range="4" rwaccess="R"/> 
		<bitfield id="TYPE3" width="1" begin="3" end="3" resetval="0x1" description="Type 3 TR is supported" range="3" rwaccess="R"/> 
		<bitfield id="TYPE2" width="1" begin="2" end="2" resetval="0x1" description="Type 2 TR is supported" range="2" rwaccess="R"/> 
		<bitfield id="TYPE1" width="1" begin="1" end="1" resetval="0x1" description="Type 1 TR is supported" range="1" rwaccess="R"/> 
		<bitfield id="TYPE0" width="1" begin="0" end="0" resetval="0x1" description="Type 0 TR is supported" range="0" rwaccess="R"/>
	</register>
	<register id="BCDMA_GCFG_CAP1" acronym="BCDMA_GCFG_CAP1" offset="0x24" width="32" description="The Capabilities Register 1 specifies which standard features this BCDMA instance supports.">
		<bitfield id="SECTR" width="1" begin="3" end="3" resetval="0x0" description="Maximum second TR function that is supported" range="3" rwaccess="R"/> 
		<bitfield id="DFMT" width="1" begin="2" end="2" resetval="0x0" description="Maximum data reformatting function that is supported" range="2" rwaccess="R"/> 
		<bitfield id="ELTYPE" width="1" begin="1" end="1" resetval="0x0" description="Maximum element type value that is supported." range="1" rwaccess="R"/> 
		<bitfield id="AMODE" width="1" begin="0" end="0" resetval="0x0" description="The maximum AMODE that is supported. If AMODE is supported then DIR field must be supported for that AMODE." range="0" rwaccess="R"/>
	</register>
	<register id="BCDMA_GCFG_CAP2" acronym="BCDMA_GCFG_CAP2" offset="0x28" width="32" description="The Capabilities Register 2 specifies how many resources this BCDMA instance supports.">
		<bitfield id="RCHAN_CNT" width="9" begin="26" end="18" resetval="0x20" description="Rx split channel count" range="26 - 18" rwaccess="R"/> 
		<bitfield id="TCHAN_CNT" width="9" begin="17" end="9" resetval="0x20" description="Tx split channel count" range="17 - 9" rwaccess="R"/> 
		<bitfield id="CHAN_CNT" width="9" begin="8" end="0" resetval="0x28" description="BC channel count" range="8 - 0" rwaccess="R"/>
	</register>
	<register id="BCDMA_GCFG_CAP3" acronym="BCDMA_GCFG_CAP3" offset="0x2C" width="32" description="The Capabilities Register 3 specifies how many resources this BCDMA instance supports.">
		<bitfield id="UCHAN_CNT" width="9" begin="31" end="23" resetval="0x0" description="BC ultra high capacity internal channel count" range="31 - 23" rwaccess="R"/> 
		<bitfield id="HCHAN_CNT" width="9" begin="22" end="14" resetval="0x0" description="BC high capacity internal channel count" range="22 - 14" rwaccess="R"/>
	</register>
	<register id="BCDMA_GCFG_CAP4" acronym="BCDMA_GCFG_CAP4" offset="0x30" width="32" description="The Capabilities Register 4 specifies how many resources this BCDMA instance supports.">
		<bitfield id="TUCHAN_CNT" width="8" begin="31" end="24" resetval="0x0" description="TX ultra high capacity internal channel count" range="31 - 24" rwaccess="R"/> 
		<bitfield id="THCHAN_CNT" width="8" begin="23" end="16" resetval="0x0" description="TX high capacity internal channel count" range="23 - 16" rwaccess="R"/> 
		<bitfield id="RUCHAN_CNT" width="8" begin="15" end="8" resetval="0x0" description="RX ultra high capacity internal channel count" range="15 - 8" rwaccess="R"/> 
		<bitfield id="RHCHAN_CNT" width="8" begin="7" end="0" resetval="0x0" description="RX high capacity internal channel count" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="BCDMA_GCFG_PM0" acronym="BCDMA_GCFG_PM0" offset="0x60" width="32" description="This register enables or inhibits automatic clock gating to individual sub-blocks">
		<bitfield id="NOGATE_RSVD4" width="17" begin="31" end="15" resetval="0x0" description="Reserved PM signals." range="31 - 15" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RDEC2" width="1" begin="14" end="14" resetval="0x0" description="When set inhibits automatic gating of clock." range="14" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD3" width="2" begin="13" end="12" resetval="0x0" description="Reserved PM signals." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="NOGATE_SDEC3" width="1" begin="11" end="11" resetval="0x0" description="When set inhibits automatic gating of clock." range="11" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD2" width="3" begin="10" end="8" resetval="0x0" description="Reserved PM signals." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="NOGATE_WARB3" width="1" begin="7" end="7" resetval="0x0" description="When set inhibits automatic gating of clock." range="7" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD1" width="3" begin="6" end="4" resetval="0x0" description="Reserved PM signals." range="6 - 4" rwaccess="R/W"/> 
		<bitfield id="NOGATE_CARB3" width="1" begin="3" end="3" resetval="0x0" description="When set inhibits automatic gating of clock." range="3" rwaccess="R/W"/> 
		<bitfield id="NOGATE_CARB2" width="1" begin="2" end="2" resetval="0x0" description="When set inhibits automatic gating of clock." range="2" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD0" width="2" begin="1" end="0" resetval="0x0" description="Reserved PM signals." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_GCFG_PM1" acronym="BCDMA_GCFG_PM1" offset="0x64" width="32" description="This register enables or inhibits automatic clock gating to individual sub-blocks">
		<bitfield id="NOGATE_EDC" width="1" begin="31" end="31" resetval="0x0" description="When set inhibits automatic gating of clock." range="31" rwaccess="R/W"/> 
		<bitfield id="NOGATE_STATS" width="1" begin="30" end="30" resetval="0x0" description="When set inhibits automatic gating of clock." range="30" rwaccess="R/W"/> 
		<bitfield id="NOGATE_PROXY" width="1" begin="29" end="29" resetval="0x0" description="When set inhibits automatic gating of clock." range="29" rwaccess="R/W"/> 
		<bitfield id="NOGATE_PSILIF" width="1" begin="28" end="28" resetval="0x0" description="When set inhibits automatic gating of clock." range="28" rwaccess="R/W"/> 
		<bitfield id="NOGATE_P2P" width="1" begin="27" end="27" resetval="0x0" description="When set inhibits automatic gating of clock." range="27" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD8" width="1" begin="26" end="26" resetval="0x0" description="Reserved PM signals." range="26" rwaccess="R/W"/> 
		<bitfield id="NOGATE_EHANDLER" width="1" begin="25" end="25" resetval="0x0" description="When set inhibits automatic gating of clock." range="25" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RINGOCC" width="1" begin="24" end="24" resetval="0x0" description="When set inhibits automatic gating of clock." range="24" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RPCF" width="1" begin="23" end="23" resetval="0x0" description="When set inhibits automatic gating of clock." range="23" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TPCF" width="1" begin="22" end="22" resetval="0x0" description="When set inhibits automatic gating of clock." range="22" rwaccess="R/W"/> 
		<bitfield id="NOGATE_PCF" width="1" begin="21" end="21" resetval="0x0" description="When set inhibits automatic gating of clock." range="21" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD7" width="2" begin="20" end="19" resetval="0x0" description="Reserved PM signals." range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="NOGATE_CFG" width="1" begin="18" end="18" resetval="0x0" description="When set inhibits automatic gating of clock." range="18" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD6" width="7" begin="17" end="11" resetval="0x0" description="Reserved PM signals." range="17 - 11" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TRCU" width="1" begin="10" end="10" resetval="0x0" description="When set inhibits automatic gating of clock." range="10" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RSVD5" width="1" begin="9" end="9" resetval="0x0" description="Reserved PM signals." range="9" rwaccess="R/W"/> 
		<bitfield id="NOGATE_EVTCU" width="1" begin="8" end="8" resetval="0x0" description="When set inhibits automatic gating of clock." range="8" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RWU3" width="1" begin="7" end="7" resetval="0x0" description="When set inhibits automatic gating of clock." range="7" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RWU2" width="1" begin="6" end="6" resetval="0x0" description="When set inhibits automatic gating of clock." range="6" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RWU1" width="1" begin="5" end="5" resetval="0x0" description="When set inhibits automatic gating of clock." range="5" rwaccess="R/W"/> 
		<bitfield id="NOGATE_RWU0" width="1" begin="4" end="4" resetval="0x0" description="When set inhibits automatic gating of clock." range="4" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TRU3" width="1" begin="3" end="3" resetval="0x0" description="When set inhibits automatic gating of clock." range="3" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TRU2" width="1" begin="2" end="2" resetval="0x0" description="When set inhibits automatic gating of clock." range="2" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TRU1" width="1" begin="1" end="1" resetval="0x0" description="When set inhibits automatic gating of clock." range="1" rwaccess="R/W"/> 
		<bitfield id="NOGATE_TRU0" width="1" begin="0" end="0" resetval="0x0" description="When set inhibits automatic gating of clock." range="0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_GCFG_DBGA" acronym="BCDMA_GCFG_DBGA" offset="0x78" width="32" description="This register provides a writable address which allows debug information to be read from the Debug Data Register">
		<bitfield id="DBG_EN" width="1" begin="31" end="31" resetval="0x0" description="Debug enable" range="31" rwaccess="R/W"/> 
		<bitfield id="DBG_UNIT" width="8" begin="15" end="8" resetval="0x0" description="Selects which unit to read debug information from" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DBG_ADDR" width="8" begin="7" end="0" resetval="0x0" description="Selects offset within unit to access seperate debug registers" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_GCFG_DBGD" acronym="BCDMA_GCFG_DBGD" offset="0x7C" width="32" description="This register provides read only debug data">
		<bitfield id="DBG_DATA" width="32" begin="31" end="0" resetval="0x0" description="Provides debug information from various internal units.  The value which is read back depends on which unit and register are selected in the Debug Address Register" range="31 - 0" rwaccess="R/NA"/>
	</register>
</module>